In [14]:
import pandas as pd
import numpy as np

# Manejo de Valores Nulos
Primero cargamos un dataframe con datos nulos

In [15]:
dictioanry = {
    'Col1':[1,2,3,np.nan],
    'Col2':[4,np.nan,6,7],
    'Col3':['a','b','c',None]
}

In [16]:
df = pd.DataFrame(dictioanry)

In [18]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

## Isnull()
Devuelve un objeto booleano del mismo tamaño que indica si los valores son Nulos. Los valores Nulos, como None o numpy.NaN, se asignan a valores Verdaderos. Todo lo demás se asigna a valores falsos. Los caracteres como cadenas vacías '' o numpy.inf no se consideran valores NA (a menos que establezca pandas.options.mode.use_inf_as_na = True).

In [20]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [22]:
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

## fillna()
Rellene los valores NA/NaN utilizando el método especificado.

*DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)*

In [24]:
df.fillna('Missing')

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [33]:
# Se rellenan los espacios NaN con la media numerica de sus columnas
df.fillna(df.mean())

/tmp/ipykernel_636/1539990271.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

## interpolate()
Rellene los valores de NaN utilizando un método de interpolación.

*DataFrame.interpolate(method='linear', axis=0, limit=None, inplace=False, limit_direction=None, limit_area=None, downcast=None, **kwargs)*

In [28]:
df.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

## dropna()
Eliminar valores faltantes.

*DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)*

In [35]:
df.dropna(axis=0)

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c